<template>
  <div>
      <b-jumbotron header="InstaEditor" lead="Как работает редактор текста">
        <p>Инстаграм перестал быть площадкой для публикации фото. Сегодня Инстаграм это сайт, где Вы можете узнать новости, почитать статьи и лайкнуть фотографию. Поэтому каждый пытается стать блогером, чтобы быть известным и полезным другим пользователям.</p>
        <p>Но чтобы стать полезным, нужно давать полезный контент, в приоретете текстовый. Instagram до сих пор не сделал удобного редактора для написания текста. Блогерам приходится искать и копировать <b>секретный пустой пробел</b>, чтобы разделить текст на абзацы.</p>
        <p>Поэтому, у меня пришла идея сделать простой, но удобный <nuxt-link to="/">редактор текста для Инстаграма</nuxt-link>, где Вы можете скопировать набранный текст с абзацами и вставить его при публикации очередного поста.</p>
        <b-button variant="outline-primary" @click="showModal = !showModal">Добавить в закладки</b-button>
        <b-button variant="outline-primary" to="/">Начать писать</b-button>
      </b-jumbotron>
      
      <b-modal
      v-model="showModal"
      title="Как добавить сайт в закладки"
      ok-only
    >
      Добавляйте сайт в закладки, нажимая Ctrl + D или Cmd + D
    </b-modal>
  </div>
</template>

<script>
export default {
  data() {
    return {
      showModal: false
    }
  },
  head () {
    return {
      title: 'Как написать текст с невидимым пробелом',
      meta: [
        { hid: 'description', name: 'description', content: 'Instagram до сих пор не сделал удобного редактора для написания текста. Блогерам приходится искать и копировать секретный пустой пробел, чтобы разделить текст на абзацы.' }
      ]
    }
  }
}
</script>

<style>

</style>
